## Updating Data

Let us see how we can update data in the table.

* Typical syntax

```sql
UPDATE <table_name>
SET
    col1 = val1,
    col2 = val2
WHERE <condition>
```

* If `WHERE` condition is not specified all rows in the table will be updated.
* For now we will see basic examples for update. One need to have good knowledge about `WHERE` clause to take care of complex conditions. Using `WHERE` will be covered extensively as part of filtering the data at a later point in time.

* Set user role for user_id 1 as 'A'

In [3]:
%load_ext sql

In [5]:
%env DATABASE_URL=postgresql://itversity_sms_user:sms_password@localhost:5432/itversity_sms_db

env: DATABASE_URL=postgresql://itversity_sms_user:sms_password@localhost:5432/itversity_sms_db

In [7]:
%%sql 
SELECT * FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(14, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2021, 8, 6, 13, 15, 49, 525327), datetime.datetime(2021, 8, 6, 13, 15, 49, 525327)),
 (15, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 8, 6, 13, 16, 55, 150252), datetime.datetime(2021, 8, 6, 13, 16, 55, 150252)),
 (16, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 503750), datetime.datetime(2021, 8, 6, 13, 16, 55, 503750)),
 (17, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223)),
 (18, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223)),
 (19, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223))]

In [8]:
%%sql

UPDATE users 
    SET user_role = 'A' 
WHERE user_id = 14

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
1 rows affected.

[]

In [10]:
%sql SELECT * FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 8, 6, 13, 16, 55, 150252), datetime.datetime(2021, 8, 6, 13, 16, 55, 150252)),
 (16, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 503750), datetime.datetime(2021, 8, 6, 13, 16, 55, 503750)),
 (17, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223)),
 (18, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223)),
 (19, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 8, 6, 13, 16, 55, 928223), datetime.datetime(2021, 8, 6, 13, 16, 55, 928223)),
 (14, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'A', False, datetime.datetime(2021, 8, 6, 13, 15, 49, 525327), datetime.datetime(2021, 8, 6, 13, 15, 49, 525327))]

* Set user_email_validated as well as is_active to true for all users

In [11]:
%sql SELECT user_id, user_email_validated, is_active FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, False, False),
 (16, False, True),
 (17, False, True),
 (18, False, True),
 (19, False, True),
 (14, False, False)]

In [12]:
%%sql

UPDATE users
SET
    user_email_validated = true,
    is_active = true

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[]

In [13]:
%sql SELECT user_id, user_email_validated, is_active FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, True, True),
 (16, True, True),
 (17, True, True),
 (18, True, True),
 (19, True, True),
 (14, True, True)]

* Convert case of user_email_id to upper for all the records

In [14]:
%sql SELECT user_id, user_email_id FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, 'donald@duck.com'),
 (16, 'mickey@mouse.com'),
 (17, 'gbradock0@barnesandnoble.com'),
 (18, 'tlyness1@paginegialle.it'),
 (19, 'amesias2@twitpic.com'),
 (14, 'scott@tiger.com')]

In [15]:
%%sql

UPDATE users
SET
    user_email_id = upper(user_email_id)

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[]

In [16]:
%sql SELECT user_id, user_email_id FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, 'DONALD@DUCK.COM'),
 (16, 'MICKEY@MOUSE.COM'),
 (17, 'GBRADOCK0@BARNESANDNOBLE.COM'),
 (18, 'TLYNESS1@PAGINEGIALLE.IT'),
 (19, 'AMESIAS2@TWITPIC.COM'),
 (14, 'SCOTT@TIGER.COM')]

* Add new column by name **user_full_name** and update it by concatenating **user_first_name** and **user_last_name**.

In [17]:
%%sql

ALTER TABLE users ADD COLUMN user_full_name VARCHAR(50)

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
Done.

[]

In [18]:
%sql SELECT user_id, user_first_name, user_last_name, user_full_name FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, 'Donald', 'Duck', None),
 (16, 'Mickey', 'Mouse', None),
 (17, 'Gordan', 'Bradock', None),
 (18, 'Tobe', 'Lyness', None),
 (19, 'Addie', 'Mesias', None),
 (14, 'Scott', 'Tiger', None)]

In [19]:
%sql SELECT concat(user_first_name, ' ', user_last_name) FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[('Donald Duck',),
 ('Mickey Mouse',),
 ('Gordan Bradock',),
 ('Tobe Lyness',),
 ('Addie Mesias',),
 ('Scott Tiger',)]

In [20]:
%%sql 

UPDATE users
    SET user_full_name = upper(concat(user_first_name, ' ', user_last_name))

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[]

In [22]:
%sql SELECT user_id, user_first_name, user_last_name, user_full_name FROM users

 * postgresql://itversity_sms_user:***@localhost:5432/itversity_sms_db
6 rows affected.

[(15, 'Donald', 'Duck', 'DONALD DUCK'),
 (16, 'Mickey', 'Mouse', 'MICKEY MOUSE'),
 (17, 'Gordan', 'Bradock', 'GORDAN BRADOCK'),
 (18, 'Tobe', 'Lyness', 'TOBE LYNESS'),
 (19, 'Addie', 'Mesias', 'ADDIE MESIAS'),
 (14, 'Scott', 'Tiger', 'SCOTT TIGER')]